; domain
(define (domain rover-minerales)
  (:requirements :typing :negative-preconditions)

  (:types
    localidad mineral rover - object
  )

  (:predicates
    (en-rover ?r - rover ?l - localidad)        ; el rover está en localidad l
    (en-mineral ?m - mineral ?l - localidad)    ; el mineral m está en localidad l
    (transportando ?r - rover ?m - mineral)     ; el rover lleva el mineral m
    (laboratorio ?l - localidad)                ; localidad l tiene laboratorio
    (analizado ?m - mineral)                    ; el mineral m ya fue analizado
    (camino ?l1 - localidad ?l2 - localidad)    ; existe camino de l1 a l2
    (manos-libres ?r - rover)                   ; el rover no carga nada
  )

  ; ------------------------------------------------------------------
  ; ACCIÓN: Mover el rover de una localidad a otra
  ; ------------------------------------------------------------------
  (:action mover
    :parameters (?r - rover ?desde - localidad ?hacia - localidad)
    :precondition (and
      (en-rover ?r ?desde)
      (camino ?desde ?hacia)
    )
    :effect (and
      (not (en-rover ?r ?desde))
      (en-rover ?r ?hacia)
    )
  )

  ; ------------------------------------------------------------------
  ; ACCIÓN: Recoger un mineral en la localidad donde está el rover
  ; ------------------------------------------------------------------
  (:action recoger
    :parameters (?r - rover ?m - mineral ?l - localidad)
    :precondition (and
      (en-rover ?r ?l)
      (en-mineral ?m ?l)
      (manos-libres ?r)
    )
    :effect (and
      (transportando ?r ?m)
      (not (en-mineral ?m ?l))
      (not (manos-libres ?r))
    )
  )

  ; ------------------------------------------------------------------
  ; ACCIÓN: Entregar mineral en el laboratorio
  ; ------------------------------------------------------------------
  (:action entregar
    :parameters (?r - rover ?m - mineral ?l - localidad)
    :precondition (and
      (en-rover ?r ?l)
      (transportando ?r ?m)
      (laboratorio ?l)
    )
    :effect (and
      (not (transportando ?r ?m))
      (manos-libres ?r)
      (analizado ?m)
    )
  )
)

; problem
(define (problem rover-problema3)
  (:domain rover-minerales)

  (:objects
    rover1 rover2 - rover
    loc1 loc2 loc3 loc4 loc5 loc8 - localidad
    mineral1 mineral2 mineral3 mineral4 - mineral
  )

  (:init
    ; Posiciones iniciales
    (en-rover rover1 loc3)
    (manos-libres rover1)
    (en-rover rover2 loc4)
    (manos-libres rover2)

    ; Minerales
    (en-mineral mineral1 loc1)
    (en-mineral mineral2 loc2)
    (en-mineral mineral3 loc1)   ; segundo mineral en loc1
    (en-mineral mineral4 loc8)

    ; Laboratorio
    (laboratorio loc5)

    ; Red de caminos
    (camino loc3 loc1)
    (camino loc1 loc3)
    (camino loc3 loc2)
    (camino loc2 loc4)
    (camino loc3 loc4)
    (camino loc4 loc3)
    (camino loc4 loc5)
    (camino loc5 loc4)

    ; Nuevos caminos hacia loc8
    (camino loc1 loc8)     ; una sola dirección
    (camino loc8 loc4)     ; salida directa a loc4
  )

  (:goal
    (and
      (analizado mineral1)
      (analizado mineral2)
      (analizado mineral3)
      (analizado mineral4)
    )
  )
)

; plan
1. (mover rover1 loc3 loc1)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc1)
   goals met: 0 of 4
2. (mover rover1 loc1 loc8)
   deleted: (en-rover rover1 loc1)
   added: (en-rover rover1 loc8)
   goals met: 0 of 4
3. (mover rover2 loc4 loc3)
   deleted: (en-rover rover2 loc4)
   added: (en-rover rover2 loc3)
   goals met: 0 of 4
4. (mover rover2 loc3 loc1)
   deleted: (en-rover rover2 loc3)
   added: (en-rover rover2 loc1)
   goals met: 0 of 4
5. (recoger rover1 mineral4 loc8)
   deleted: (en-mineral mineral4 loc8) (manos-libres rover1)
   added: (transportando rover1 mineral4)
   goals met: 0 of 4
6. (mover rover1 loc8 loc4)
   deleted: (en-rover rover1 loc8)
   added: (en-rover rover1 loc4)
   goals met: 0 of 4
7. (mover rover1 loc4 loc5)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc5)
   goals met: 0 of 4
8. (recoger rover2 mineral1 loc1)
   deleted: (en-mineral mineral1 loc1) (manos-libres rover2)
   added: (transportando rover2 mineral1)
   goals met: 0 of 4
9. (mover rover2 loc1 loc3)
   deleted: (en-rover rover2 loc1)
   added: (en-rover rover2 loc3)
   goals met: 0 of 4
10. (mover rover2 loc3 loc4)
   deleted: (en-rover rover2 loc3)
   added: (en-rover rover2 loc4)
   goals met: 0 of 4
11. (mover rover2 loc4 loc5)
   deleted: (en-rover rover2 loc4)
   added: (en-rover rover2 loc5)
   goals met: 0 of 4
12. (entregar rover1 mineral4 loc5)
   deleted: (transportando rover1 mineral4)
   added: (manos-libres rover1) (analizado mineral4)
   goals met: 1 of 4
13. (mover rover1 loc5 loc4)
   deleted: (en-rover rover1 loc5)
   added: (en-rover rover1 loc4)
   goals met: 1 of 4
14. (mover rover1 loc4 loc3)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc3)
   goals met: 1 of 4
15. (mover rover1 loc3 loc1)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc1)
   goals met: 1 of 4
16. (recoger rover1 mineral3 loc1)
   deleted: (en-mineral mineral3 loc1) (manos-libres rover1)
   added: (transportando rover1 mineral3)
   goals met: 1 of 4
17. (mover rover1 loc1 loc3)
   deleted: (en-rover rover1 loc1)
   added: (en-rover rover1 loc3)
   goals met: 1 of 4
18. (mover rover1 loc3 loc4)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc4)
   goals met: 1 of 4
19. (mover rover1 loc4 loc5)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc5)
   goals met: 1 of 4
20. (entregar rover1 mineral3 loc5)
   deleted: (transportando rover1 mineral3)
   added: (manos-libres rover1) (analizado mineral3)
   goals met: 2 of 4
21. (mover rover1 loc5 loc4)
   deleted: (en-rover rover1 loc5)
   added: (en-rover rover1 loc4)
   goals met: 2 of 4
22. (mover rover1 loc4 loc3)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc3)
   goals met: 2 of 4
23. (mover rover1 loc3 loc2)
   deleted: (en-rover rover1 loc3)
   added: (en-rover rover1 loc2)
   goals met: 2 of 4
24. (recoger rover1 mineral2 loc2)
   deleted: (en-mineral mineral2 loc2) (manos-libres rover1)
   added: (transportando rover1 mineral2)
   goals met: 2 of 4
25. (mover rover1 loc2 loc4)
   deleted: (en-rover rover1 loc2)
   added: (en-rover rover1 loc4)
   goals met: 2 of 4
26. (mover rover1 loc4 loc5)
   deleted: (en-rover rover1 loc4)
   added: (en-rover rover1 loc5)
   goals met: 2 of 4
27. (entregar rover1 mineral2 loc5)
   deleted: (transportando rover1 mineral2)
   added: (manos-libres rover1) (analizado mineral2)
   goals met: 3 of 4
28. (entregar rover2 mineral1 loc5)
   deleted: (transportando rover2 mineral1)
   added: (manos-libres rover2) (analizado mineral1)
   goals met: 4 of 4
